Revit 2027 API
PerformanceAdviser.GetRuleDescription(Int32) Method
 Retrieves the description of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetRuleDescription(
	int index
)
Public Function GetRuleDescription (
	index As Integer
) As String
public:
String^ GetRuleDescription(
	int index
)
member GetRuleDescription :
        index : int -> string
Parameters
index Int32
 The rule index to get information for.
Return Value
String
 The description of the rule.
See Also
Reference
PerformanceAdviser Class
GetRuleDescription Overload
Autodesk.Revit.DB Namespace